In [5]:
# Standard Imports
# Python ships with Sqlite3 module. 

import sqlite3
import pandas as pd

# To use the module, create a connection object that represents the database. 
# Download Sakila DB. 
# Make sure you keep the copy in the same directory of Jupyter notebook. Use pwd to see your Jupyter directory.

conn = sqlite3.connect('sakila-db/sakila.db')

### Sqlite3 way of selecting and displaying top 5 records.

STEP 1: Create a cursor object. 

STEP 2: Use Cursor's execute method for our query.

In [18]:
cur = conn.cursor()
cur.execute('''SELECT * from country LIMIT 5''')
for row in cur:
    print(row)

(1, 'Afghanistan', '2011-09-14 18:05:01')
(2, 'Algeria', '2011-09-14 18:05:01')
(3, 'American Samoa', '2011-09-14 18:05:01')
(4, 'Angola', '2011-09-14 18:05:01')
(5, 'Anguilla', '2011-09-14 18:05:01')

### Using pandas to exceute query and display data in the form of DataFrame

Syntax : 

panda.read_sql('sql query', 'pass sqlite connection object')

In [17]:
sql_query = '''SELECT * from country'''

sql_df = pd.read_sql(sql_query, conn)

sql_df.head()

   country_id         country          last_update
0           1     Afghanistan  2011-09-14 18:05:01
1           2         Algeria  2011-09-14 18:05:01
2           3  American Samoa  2011-09-14 18:05:01
3           4          Angola  2011-09-14 18:05:01
4           5        Anguilla  2011-09-14 18:05:01